// 日計算
var Koyomi = require(global.minify ? '../lib/minify' : '..');
var add = Koyomi.add;
var eq = require('assert').equal;
function test(actual, expected) {
  eq(actual ? actual.toString() : null, expected ? new Date(expected).toString() : null);
}

test(add('2015-1-1', '5年'), '2020-1-1');
test(add('2015-1-2', '5日'), '2015-1-7');
test(add('2015-1-31', '1ケ月'), '2015-2-28');
test(add('2015-1-2', '5日'), '2015-1-7');

test(add('2015-1-1 00:00:00.000', '1年')    , '2016-1-1');
test(add('2015-1-1 00:00:00.000', '1ヶ月')  , '2015-2-1');
test(add('2015-1-1 00:00:00.000', '1週間')  , '2015-1-8');
test(add('2015-1-1 00:00:00.000', '1日')    , '2015-1-2');
test(add('2015-1-1 00:00:00.000', '1時間')  , '2015-1-1 01:00:00.000');
test(add('2015-1-1 00:00:00.000', '1分')    , '2015-1-1 00:01:00.000');
test(add('2015-1-1 00:00:00.000', '1秒')    , '2015-1-1 00:00:01.000');
test(add('2015-1-1 00:00:00.000', '1ミリ秒'), '2015-1-1 00:00:00.001');

test(add('2015-2-28', '1年'), '2016-2-28');
test(add('2016-2-29', '1年'), '2017-2-28');
test(add('2016-2-29', '4年'), '2020-2-29');