// 第x name曜日 計算
var Koyomi = require('..');
var get = Koyomi.getXDay;
var eq = require('assert').equal;

eq(get(2015,1,1,'月'), 5);
eq(get(2015,1,2,'月'), 12);
eq(get(2015,1,3,'月'), 19);
eq(get(2015,1,4,'月'), 26);

eq(get(2015,1,1,'土'), 3);
eq(get(2015,1,4,'土'), 24);

eq(get(2015,1,5,'日'), 25);
eq(get(2015,1,5,'月'), 26);
eq(get(2015,1,5,'火'), 27);
eq(get(2015,1,5,'水'), 28);
eq(get(2015,1,5,'木'), 29);
eq(get(2015,1,5,'金'), 30);
eq(get(2015,1,5,'土'), 31);

eq(get(2015,5,4,'日'), 24);
eq(get(2015,5,5,'日'), 31);
eq(get(2015,5,5,'月'), 25);
eq(get(2015,5,5,'火'), 26);
eq(get(2015,5,5,'水'), 27);
eq(get(2015,5,5,'木'), 28);
eq(get(2015,5,5,'金'), 29);
eq(get(2015,5,5,'土'), 30);