// 口語表現

var koyomi = require('../..').create();
var kind = koyomi.kind.bind(koyomi);
var eq = require('assert').equal;

eq(kind(new Date()), 'たった今');
eq(kind('2:00', '1:55'), '5分後');
eq(kind('2:00', '10:00'), '8時間前');
eq(kind('10:00', '2:00'), '8時間後');
eq(kind('2015-10-1', '2015-10-4'), '3日前');
eq(kind('2015-10-4', '2015-10-1'), '3日後');

eq(kind('2015-10-5', '2015-12-1'), '1ヶ月前');
eq(kind('2015-10-4', '2015-12-1'), '2ヶ月前');
eq(kind('2015-10-1', '2015-12-1'), '2ヶ月前');
eq(kind('2015-9-30', '2015-12-1'), '2ヶ月前');
eq(kind('2015-9-4' , '2015-12-1'), '2ヶ月前');
eq(kind('2015-9-3' , '2015-12-1'), '3ヶ月前');
